compressiblePhaseChangeInterFoam_v2206/run/thermosyphon20FR/fluid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 0 -1)
    (7 0 -1)
    (7 500 -1)
    (0 500 -1)
    (0 0  1)
    (7 0  1)
    (7 500  1)
    (0 500  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (21 1500 1) simpleGrading (1 1 1)
/*    hex (0 1 2 3 4 5 6 7) (31 1500 1) simpleGrading (
        ((0.2 0.3 4)  (0.6 0.4 1) (0.2 0.3 0.25))
        1 
        1
    )
*/
);

boundary
(
    internalFluidWalls
    {
        type mappedWall;

        // What to sample:
        sampleMode      nearestPatchFace;

        // Simulation world to sample
        sampleWorld     solid;

        // Region to sample
        sampleRegion    region0;

        // If sampleMode is nearestPatchFace : patch to find faces of
        samplePatch     internalSolidWalls;

        // Use database to get data from (one-way or loose coupling in
        // combination with functionObject)
        sampleDatabase    true;


        faces
        (
            (1 5 4 0)
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
